EDT/УТ/src/Documents/зпФиксацияДополнительныхНачисленийУдержаний/зпФиксацияДополнительныхНачисленийУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>зпФиксацияДополнительныхНачисленийУдержаний</name>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоСуммаНачислений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоСуммаУдержаний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияУдержания</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НачислениеУдержание</name>
      <type>
        <types>CatalogRef.зпУдержания</types>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/зпФиксацияДополнительныхНачисленийУдержаний/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Асеев 09.02.2024 (Задача № 5227)>>>
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		зпРаботаСРасчетомЗарплатыСервер.ПередЗаписьюДокументаЗП(Отказ, РежимЗаписи, ЭтотОбъект);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Асеев 09.02.2024 (Задача № 5227)<<<
	
	Если Не ЭтоНовый() Тогда
		Если baoВызовСервера.РейсЗакрыт(Ссылка) Тогда
			Отказ = Истина;
			Сообщить("Документ закрыт для редактирования");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СуммаНачислений = 0;
	СуммаУдержаний = 0;
	
	ТипНачисление = Тип("СправочникСсылка.зпНачисления");
	ТипУдержание = Тип("СправочникСсылка.зпУдержания");
	Для Каждого СтрокаНачисления Из НачисленияУдержания Цикл
		ТипЗначения = ТипЗнч(СтрокаНачисления.НачислениеУдержание);
		Если ТипЗначения = ТипНачисление Тогда
			СуммаНачислений = СуммаНачислений + СтрокаНачисления.Сумма;
		ИначеЕсли ТипЗначения = ТипУдержание Тогда
			СуммаУдержаний = СуммаУдержаний + СтрокаНачисления.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	ИтогоСуммаНачислений = СуммаНачислений;
	ИтогоСуммаУдержаний = СуммаУдержаний;
	
КонецПроцедуры
